Tekla Open API Reference for Tekla Structures 2025
UndefinedCurveDirectionException Fields
The UndefinedCurveDirectionException type exposes the following members.
Fields
Name | Description
OperationStatus
 Possible error statuses for geometry creation/modification commands.
 (Inherited from ConnectiveGeometryException.)
Top
See Also
Reference
UndefinedCurveDirectionException Class
Tekla.Structures.Model Namespace